# Latihan 1

In [1]:
test = [1,2,3,4]

In [2]:
test.append(5)

In [3]:
test

[1, 2, 3, 4, 5]

In [4]:
test.extend([6,7,8,9,10])

In [5]:
test

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [6]:
def kali2(a) :
    return a * 2

# kali2 = lambda a : a * 2

In [7]:
# test = list(map(kali2, test))
test = list(map(lambda a: a * 2 
                if a > 3 else a, test))
test

[1, 2, 3, 8, 10, 12, 14, 16, 18, 20]

In [8]:
test = list(filter(lambda b : True if b % 2 == 0 else False, test))

In [9]:
test

[2, 8, 10, 12, 14, 16, 18, 20]

In [10]:
kucing = 'Hello Apa kabar?'

In [11]:
def tampilkan() :
    global kucing, test
    kucing = 'Tamasya'
    test = [1,2]
    print(kucing)

In [12]:
tampilkan()

Tamasya

In [13]:
kucing

'Tamasya'

In [14]:
test

[1, 2]

In [15]:
contohdict = { 'nama': 'Baron', 5: 10, 'tampilkan': lambda a,b : print(str(a) + ' Hello ' + str(b)) }

In [16]:
contohdict['nama']

'Baron'

In [17]:
contohdict[5]

10

In [18]:
contohdict['tampilkan'](20,7)

20 Hello 7

In [19]:
nama = 'Baron'
umur = 22

In [20]:
print("I'm {}, and i'm {} years old".format(nama, umur))

I'm Baron, and i'm 22 years old

In [21]:
print(f"I'm {nama}, and i'm {umur} years old")

I'm Baron, and i'm 22 years old

In [22]:
print("I'm {a}, and i'm {b} years old".format(b=umur, a=nama))

I'm Baron, and i'm 22 years old

In [23]:
a = list(range(1,21,2))
a

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

In [24]:
for item in [1,2,3,4,5] :
    print('angka {}'.format(item))

angka 1
angka 2
angka 3
angka 4
angka 5

In [25]:
for i in range(15, -1, -1) :
    if(i % 2 == 0):
        print(i)

14
12
10
8
6
4
2
0

In [26]:
c = zip(range(5), range(5,-1,-1))
c

In [27]:
c = list(c)
c

[(0, 5), (1, 4), (2, 3), (3, 2), (4, 1)]

In [28]:
c

[(0, 5), (1, 4), (2, 3), (3, 2), (4, 1)]

In [31]:
for i,j in c:
    print(j)

5
4
3
2
1

In [32]:
for i,j in zip(range(4), range(10,0,-1)) :
    print(j)

10
9
8
7

In [33]:
True and False

False

In [34]:
True and True

True

In [35]:
not(True)

False

In [36]:
not(False or True)

False

In [37]:
m = [1,2,3,4,5]

In [39]:
print(sum(m))

15

In [40]:
m = [False, True, True]

In [41]:
print(sum(m))

2

In [42]:
contohset = { 5,3,3,3,3,2,2,1 }
contohset

{1, 2, 3, 5}

In [44]:
list(contohset)[2]

3

In [45]:
contohlist = [1,1,1,3,3,2,2,2]
contohlist = list(set(contohlist))
contohlist

[1, 2, 3]

In [47]:
contohke = 'halo aku aku'
contohke[2:]

'lo aku aku'

In [48]:
dict1 = {}
dict1['karimun'] = 'Test'
dict1

{'karimun': 'Test'}

In [49]:
5 == '5'

False

In [50]:
len(contohlist)

3

In [70]:
coba = tuple(range(5))
coba

(0, 1, 2, 3, 4)

In [71]:
hasil = ['{} kucing'.format(i + 2) if i % 2 == 0 else 'kambing' for i in coba]

In [72]:
hasil

['2 kucing', 'kambing', '4 kucing', 'kambing', '6 kucing']

In [73]:
def testfunc(a = 5, b = 3, c = 1):
    print(a + b + c)

In [75]:
testfunc(c=5, a=3)

11

In [78]:
'hello,apa,kabar,dunia'.split(',')

['hello', 'apa', 'kabar', 'dunia']

In [79]:
d = { 'a': 50, 'b': 20, 'c': 30 }

In [84]:
d.keys()

dict_keys(['a', 'b', 'c'])

In [87]:
d.items()

dict_items([('a', 50), ('b', 20), ('c', 30)])

In [86]:
for key,value in d.items() :
    print('{} : {}'.format(key,value))

a : 50
b : 20
c : 30

In [88]:
d.values()

dict_values([50, 20, 30])

In [89]:
'ab' in 'abracadabra'

True

In [90]:
import numpy as np

In [103]:
my_list = [[1,2,3], [4,5,6], [7,8,9]]
my_matrix = np.array(my_list)

In [104]:
my_list

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [105]:
my_matrix

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [106]:
my_matrix.mean(axis=0)

array([4., 5., 6.])

In [109]:
my_matrix[1:,:2]

array([[4, 5],
       [7, 8]])

In [110]:
np.array(range(0,10))

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [113]:
np.arange(0,10).reshape(2,5)

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [120]:
import pandas as pd

In [125]:
# df = pd.DataFrame([[1,'Baron',22],[2,'Budi',25], [3,'Ceci',31]],
#                  columns=['id','nama','umur'],
#                  index=['a','b','c'])
df = pd.DataFrame({ 'id': [1,2,3], 
                  'nama': ['Baron','Budi','Ceci'],
                  'umur': [22,25,31] }, index=['a','b','c'])

In [127]:
df

   id   nama  umur
a   1  Baron    22
b   2   Budi    25
c   3   Ceci    31

In [143]:
df['nama']

a    Baron
b     Budi
c     Ceci
Name: nama, dtype: object

In [136]:
df.loc['b']

id         2
nama    Budi
umur      25
Name: b, dtype: object

In [145]:
df['pekerjaan'] = ['Guru','Polisi','Tukang Bakso']

In [146]:
df

   id   nama  umur     pekerjaan
a   1  Baron    22          Guru
b   2   Budi    25        Polisi
c   3   Ceci    31  Tukang Bakso

In [147]:
df['hasil tambah id dengan umur'] = df['id'] + df['umur']
df

   id   nama  umur     pekerjaan  hasil tambah id dengan umur
a   1  Baron    22          Guru                           23
b   2   Budi    25        Polisi                           27
c   3   Ceci    31  Tukang Bakso                           34

In [148]:
df['panjangNama'] = df['nama'].apply(len)

In [149]:
df

   id   nama  umur     pekerjaan  hasil tambah id dengan umur  panjangNama
a   1  Baron    22          Guru                           23            5
b   2   Budi    25        Polisi                           27            4
c   3   Ceci    31  Tukang Bakso                           34            4

In [150]:
df['umurKali2'] = df['umur'] * 2
df

,id,nama,umur,pekerjaan,hasil tambah id dengan umur,panjangNama,umurKali2
a,1,Baron,22,Guru,23,5,44
b,2,Budi,25,Polisi,27,4,50
c,3,Ceci,31,Tukang Bakso,34,4,62

In [151]:
df['umurKali3'] = df['umur'].apply(lambda x : x * 3)
df

,id,nama,umur,pekerjaan,hasil tambah id dengan umur,panjangNama,umurKali2,umurKali3
a,1,Baron,22,Guru,23,5,44,66
b,2,Budi,25,Polisi,27,4,50,75
c,3,Ceci,31,Tukang Bakso,34,4,62,93